# ML coding test

In [97]:
import pandas as pd
df=pd.read_csv('titanic.csv')

In [98]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1.0,NaN,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,NaN,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0.0,NaN,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [99]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,13.00,NaN,S
887,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.00,B42,S
888,889,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.45,NaN,S
889,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.00,C148,C
890,891,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.75,NaN,Q

In [100]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     886 non-null    float64
 2   Pclass       886 non-null    float64
 3   Name         887 non-null    str
 4   Sex          887 non-null    str
 5   Age          709 non-null    float64
 6   SibSp        887 non-null    float64
 7   Parch        887 non-null    float64
 8   Ticket       891 non-null    str
 9   Fare         887 non-null    float64
 10  Cabin        204 non-null    str
 11  Embarked     889 non-null    str
dtypes: float64(6), int64(1), str(5)
memory usage: 83.7 KB

In [101]:
df.isnull().sum()

PassengerId      0
Survived         5
Pclass           5
Name             4
Sex              4
Age            182
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

# MEAN

In [102]:
# 1.Mean orqali to'ldirish
# df['Survived'].fillna(df['Survived'].mean(),inplace=True)
# df['Survived'] = df['Survived'].fillna(df['Survived'].mean(),inplace=True)
df.fillna({'Survived': df['Survived'].mean()},inplace=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1.0,NaN,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,NaN,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0.0,NaN,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,13.0000,NaN,S
887,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.0000,B42,S
888,889,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.4500,NaN,S
889,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C148,C
890,891,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.7500,NaN,Q

In [103]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           5
Name             4
Sex              4
Age            182
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

# MODE

In [104]:
# 2.Mode orqali to'ldirish
# df['Pclass'].fillna(df['Pclass'].mode()[0],inplace=True)
df['Pclass'] = df['Pclass'].fillna(df['Pclass'].mode()[0],inplace=True)

C:\Users\WIN\AppData\Local\Temp\ipykernel_4856\3415768120.py:3: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df['Pclass'] = df['Pclass'].fillna(df['Pclass'].mode()[0],inplace=True)

In [105]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             4
Sex              4
Age            182
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

# MEDIAN

In [106]:
# 3.Median orqali to'ldirish
# df['Age'].fillna(df['Age'].median(),inplace=True)
df['Age'] = df['Age'].fillna(df['Age'].median(),inplace=True)

C:\Users\WIN\AppData\Local\Temp\ipykernel_4856\4180886915.py:3: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df['Age'] = df['Age'].fillna(df['Age'].median(),inplace=True)

In [107]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             4
Sex              4
Age              0
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

# FIXED

In [108]:
# 4.Fixed orqali to'ldirish
# df['Name'].fillna('Alli',inplace=True)
df['Name'] = df['Name'].fillna('Alli',inplace=True)

C:\Users\WIN\AppData\Local\Temp\ipykernel_4856\4243876579.py:3: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df['Name'] = df['Name'].fillna('Alli',inplace=True)

In [109]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              4
Age              0
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

# DROP

In [ ]:
# 5.Istalgan ustunni tashlab yuborish
df.drop('Sex',axis=1,inplace=True)

In [111]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Age              0
SibSp            4
Parch            4
Ticket           0
Fare             4
Cabin          687
Embarked         2
dtype: int64

In [114]:
# 6.Qatorlar bo'yicha to'ldirish
df.dropna(inplace=True)

In [115]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64